driver-tests/bpelse/foreach-bpel20/ForEachJbi/test/forEach_branches2_greater2/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:for="http://localhost/ForEachBpel/forEach_branches2">
  <soapenv:Body>
    <for:part1>4</for:part1>
    <for:part2>8</for:part2>
    <for:part3>3</for:part3>
  </soapenv:Body>
</soapenv:Envelope>